1s/ERP/extensions/liko/Documents/ЛикоРаспределениеРасходовПоЭтапам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЛикоРаспределениеРасходовПоЭтапам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Распоряжение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РаспоряжениеНаОтгрузку</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТаблицаРаспределения</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/extensions/liko/AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВНаличии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

1s/ERP/extensions/liko/Documents/ЛикоРаспределениеРасходовПоЭтапам/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
&Вместо("РаспределитьОснастку")
Процедура Лико_РаспределитьОснастку() //+Лико m.shenderov 28.06.2018
	Если Объект.ВидРаспределения<>Справочники.Лико_ВидыРаспределенияРасходов.РаспределениеОснастки Тогда
		Возврат;
	КонецЕсли;
	//СкладОснастки=УправлениеСвойствами.ЗначениеСвойства(Объект.Организация,"Лико_СкладОснастки"); 
	СкладОснастки = Объект.Склад.Лико_Площадка._СкладОснастки; 
	Если Не ЗначениеЗаполнено(СкладОснастки) Тогда
		Возврат;
	КонецЕсли;
	Объект.Склад=СкладОснастки;
	Если Объект.Склад.ИспользоватьОрдернуюСхемуПриПоступлении Тогда	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
		|	ТоварыНаСкладахОстатки.Назначение КАК Назначение,
		|	ТоварыНаСкладахОстатки.Номенклатура.ЕдиницаИзмерения КАК Упаковка,
		|	ТоварыНаСкладахОстатки.Серия КАК Серия,
		|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК Количество,
		|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК КоличествоУпаковок,
		|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) КАК КоличествоРегл,
		|	&Дата КАК Дата
		|ПОМЕСТИТЬ ВтОстатки
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(
		|			&Дата,
		|			Номенклатура.ВидНоменклатуры = &ВидНоменклатурыОснастка
		|				И Склад = &Склад) КАК ТоварыНаСкладахОстатки1
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
		|				&Дата,
		|				Номенклатура.ВидНоменклатуры = &ВидНоменклатурыОснастка
		|					И Склад = &Склад) КАК ТоварыНаСкладахОстатки
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
		|					,
		|					Номенклатура.ВидНоменклатуры = &ВидНоменклатурыОснастка
		|						И Склад = &Склад) КАК ТоварыНаСкладахОстаткиТекущие
		|			ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыНаСкладахОстаткиТекущие.Номенклатура
		|				И ТоварыНаСкладахОстатки.Характеристика = ТоварыНаСкладахОстаткиТекущие.Характеристика
		|				И ТоварыНаСкладахОстатки.Характеристика = ТоварыНаСкладахОстаткиТекущие.Характеристика
		|		ПО (ТоварыНаСкладахОстатки.Номенклатура = ТоварыНаСкладахОстатки1.Номенклатура)
		|ГДЕ
		|	ТоварыНаСкладахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования <= &ДатаФормирования
		|	И ТоварыНаСкладахОстатки1.ВНаличииОстаток > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТоварыНаСкладах.Регистратор.Распоряжение.Организация КАК Организация,
		|	ВтОстатки.Серия КАК Серия
		|ПОМЕСТИТЬ ВтОрганизацияСерии
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах КАК ТоварыНаСкладах
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОстатки КАК ВтОстатки
		|		ПО ТоварыНаСкладах.Серия = ВтОстатки.Серия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтОстатки.Номенклатура КАК Номенклатура,
		|	ВтОстатки.Характеристика КАК Характеристика,
		|	ВтОстатки.Назначение КАК Назначение,
		|	ВтОстатки.Упаковка КАК Упаковка,
		|	ВтОстатки.Серия КАК Серия,
		|	ВтОстатки.Количество КАК Количество,
		|	ВтОстатки.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ВтОстатки.КоличествоРегл КАК КоличествоРегл,
		|	ВтОстатки.Дата КАК Дата
		|ИЗ
		|	ВтОстатки КАК ВтОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОрганизацияСерии КАК ВтОрганизацияСерии
		|		ПО ВтОстатки.Серия = ВтОрганизацияСерии.Серия
		|ГДЕ
		|	ВтОрганизацияСерии.Организация = &Организация
		|	И ВтОстатки.Количество > 0";

		Запрос.УстановитьПараметр("СправочникНастройки",Объект.ВидРаспределения.НастройкаУчетаПроизводственныхЗатрат);
		Запрос.УстановитьПараметр("Склад",Объект.Склад); 
		Запрос.УстановитьПараметр("Дата",КонецМесяца(Объект.Месяц));
		Запрос.УстановитьПараметр("ДатаФОрмирования",КонецМесяца(Объект.Месяц)-(Объект.ВидРаспределения.СдвигПериода*30*24*60*60));
		Запрос.УстановитьПараметр("Организация",Объект.Организация);
		Запрос.УстановитьПараметр("ВидНоменклатурыОснастка",Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыОснастка.ЗначениеПараметра);
		
		
		
		РезультатЗапроса = Запрос.Выполнить(); 		
		
		Объект.ОбщийРасходМатериалов.Загрузить(Запрос.Выполнить().Выгрузить());
		
		Объект.ТаблицаРаспределения.Загрузить(Объект.ОбщийРасходМатериалов.Выгрузить());
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
		|	ТоварыНаСкладахОстатки.Склад КАК Склад,
		|	ТоварыНаСкладахОстатки.Серия КАК Серия,
		|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК Остаток,
		|	ТоварыНаСкладахОстаткиТекущие.ВНаличииОстаток КАК ОстатокТекущий
		|ПОМЕСТИТЬ ВтОстатки
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(
		|			,
		|			Склад = &Склад
		|				И Номенклатура.ВидНоменклатуры = &ВидНоменклатуры) КАК ТоварыНаСкладахОстаткиТекущие
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
		|				&Период,
		|				Склад = &Склад
		|					И Номенклатура.ВидНоменклатуры = &ВидНоменклатуры) КАК ТоварыНаСкладахОстатки
		|		ПО (ТоварыНаСкладахОстатки.Номенклатура = ТоварыНаСкладахОстаткиТекущие.Номенклатура)
		|			И (ТоварыНаСкладахОстатки.Характеристика = ТоварыНаСкладахОстаткиТекущие.Характеристика)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтОстатки.Номенклатура КАК Номенклатура,
		|	ВтОстатки.Характеристика КАК Характеристика,
		|	ВтОстатки.Склад КАК Склад,
		|	ВтОстатки.Серия КАК Серия,
		|	ВтОстатки.Остаток КАК Остаток,
		|	ВтОстатки.ОстатокТекущий КАК ОстатокТекущий,
		|	МАКСИМУМ(ТоварыНаСкладах.Период) КАК Период,
		|	ВЫБОР
		|		КОГДА ВтОстатки.ОстатокТекущий < ВтОстатки.Остаток
		|			ТОГДА ВтОстатки.ОстатокТекущий
		|		ИНАЧЕ ВтОстатки.Остаток
		|	КОНЕЦ КАК Количество,
		|	ВЫБОР
		|		КОГДА ВтОстатки.ОстатокТекущий < ВтОстатки.Остаток
		|			ТОГДА ВтОстатки.ОстатокТекущий
		|		ИНАЧЕ ВтОстатки.Остаток
		|	КОНЕЦ КАК КоличествоУпаковок
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах КАК ТоварыНаСкладах
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОстатки КАК ВтОстатки
		|		ПО (ВтОстатки.Номенклатура = ТоварыНаСкладах.Номенклатура)
		|			И (ВтОстатки.Характеристика = ТоварыНаСкладах.Характеристика)
		|			И (ВтОстатки.Склад = ТоварыНаСкладах.Склад)
		|ГДЕ
		|	ТоварыНаСкладах.Период <= &ДатаПрихода
		|
		|СГРУППИРОВАТЬ ПО
		|	ВтОстатки.Номенклатура,
		|	ВтОстатки.Характеристика,
		|	ВтОстатки.Склад,
		|	ВтОстатки.Серия,
		|	ВтОстатки.Остаток,
		|	ВтОстатки.ОстатокТекущий";
		Запрос.УстановитьПараметр("Склад",Объект.Склад); 
		Запрос.УстановитьПараметр("Период",КонецМесяца(Объект.Месяц));
		Запрос.УстановитьПараметр("ДатаПрихода",КонецМесяца(Объект.Месяц)-(Объект.ВидРаспределения.СдвигПериода*30*24*60*60));
		Запрос.УстановитьПараметр("ВидНоменклатуры",Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыОснастка.ЗначениеПараметра);
		
		
		
		РезультатЗапроса = Запрос.Выполнить(); 		
		
		Объект.ОбщийРасходМатериалов.Загрузить(Запрос.Выполнить().Выгрузить());
		
		Объект.ТаблицаРаспределения.Загрузить(Объект.ОбщийРасходМатериалов.Выгрузить());
		
		
	КонецЕсли;
	
	
КонецПроцедуры  //-Лико m.shenderov 28.06.2018

//Процедура Лико_РаспределитьОснастку() //+Лико m.shenderov 28.06.2018
//	Если Объект.ВидРаспределения<>Справочники.Лико_ВидыРаспределенияРасходов.РаспределениеОснастки Тогда
//		Возврат;
//	КонецЕсли;
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
//	|	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
//	|	ТоварыНаСкладахОстатки.Назначение КАК Назначение,
//	|	ТоварыНаСкладахОстатки.Номенклатура.ЕдиницаИзмерения КАК Упаковка,
//	|	ТоварыНаСкладахОстатки.Серия КАК Серия,
//	|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК Количество,
//	|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК КоличествоУпаковок,
//	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) КАК КоличествоРегл,
//	|	&Дата КАК Дата
//	|ПОМЕСТИТЬ ВтОстатки
//	|ИЗ
//	|	РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата, Номенклатура.ВидНоменклатуры = &ВидНоменклатурыОснастка) КАК ТоварыНаСкладахОстатки1
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата, Номенклатура.ВидНоменклатуры = &ВидНоменклатурыОснастка) КАК ТоварыНаСкладахОстатки
//	|		ПО (ТоварыНаСкладахОстатки.Номенклатура = ТоварыНаСкладахОстатки1.Номенклатура)
//	|ГДЕ
//	|	ТоварыНаСкладахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования <= &ДатаФормирования
//	|	И ТоварыНаСкладахОстатки1.ВНаличииОстаток > 0
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ТоварыНаСкладах.Регистратор.Распоряжение.Организация КАК Организация,
//	|	ВтОстатки.Серия КАК Серия
//	|ПОМЕСТИТЬ ВтОрганизацияСерии
//	|ИЗ
//	|	РегистрНакопления.ТоварыНаСкладах КАК ТоварыНаСкладах
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОстатки КАК ВтОстатки
//	|		ПО ТоварыНаСкладах.Серия = ВтОстатки.Серия
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ВтОстатки.Номенклатура КАК Номенклатура,
//	|	ВтОстатки.Характеристика КАК Характеристика,
//	|	ВтОстатки.Назначение КАК Назначение,
//	|	ВтОстатки.Упаковка КАК Упаковка,
//	|	ВтОстатки.Серия КАК Серия,
//	|	ВтОстатки.Количество КАК Количество,
//	|	ВтОстатки.КоличествоУпаковок КАК КоличествоУпаковок,
//	|	ВтОстатки.КоличествоРегл КАК КоличествоРегл,
//	|	ВтОстатки.Дата КАК Дата
//	|ИЗ
//	|	ВтОстатки КАК ВтОстатки
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОрганизацияСерии КАК ВтОрганизацияСерии
//	|		ПО ВтОстатки.Серия = ВтОрганизацияСерии.Серия
//	|ГДЕ
//	|	ВтОрганизацияСерии.Организация = &Организация";
//	Запрос.УстановитьПараметр("СправочникНастройки",Объект.ВидРаспределения.НастройкаУчетаПроизводственныхЗатрат);
//	Запрос.УстановитьПараметр("Дата",КонецМесяца(Объект.Месяц));
//	Запрос.УстановитьПараметр("ДатаФОрмирования",КонецМесяца(Объект.Месяц)-(Объект.ВидРаспределения.СдвигПериода*30*24*60*60));
//	Запрос.УстановитьПараметр("Организация",Объект.Организация);
//	Запрос.УстановитьПараметр("ВидНоменклатурыОснастка",Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыОснастка.ЗначениеПараметра);
//	
//	
//	
//	РезультатЗапроса = Запрос.Выполнить(); 		
//	
//	Объект.ОбщийРасходМатериалов.Загрузить(Запрос.Выполнить().Выгрузить());
//	
//	Объект.ТаблицаРаспределения.Загрузить(Объект.ОбщийРасходМатериалов.Выгрузить());
//	
//	
//КонецПроцедуры  //-Лико m.shenderov 28.06.2018
